{
    "en": {
        "header" : {
            "title": "Engineering student at ENSEEIHT"
        },
        "nav": {
            "home": "Home",
            "engineering": "Engineering Courses",
            "mobility": "International Mobility",
            "civic": "Civic Engagement",
            "activities": "Sports & Activities",
            "career": "Career Development"
        },
        "home": {
            "title": "Welcome",
            "intro": "Hello! My name is Arthur GELINEAU, I’m 19 years old and currently studying at ENSEEIHT (INP Toulouse) in the Digital Sciences department. I’m passionate about cybersecurity, and I’m particularly interested in its technical aspects, such as penetration testing, Red Teaming, and bug bounty, and its strategic and entrepreneurial dimensions.",
            "p1": "Through this ePortfolio, I aim to share my academic journey, technical projects, and reflections on cybersecurity as a constantly evolving field. It reflects both my learning path at ENSEEIHT and self-taught learner in cybersecurity, my curiosity for technology, and my motivation to tackle real-world security challenges.",
            "p2": "I’m especially drawn to offensive security and to exploring how cybersecurity applies to defense and critical systems, where reliability and resilience are paramount.",
            "p3": "Feel free to browse through the different sections to learn more about my studies, technical work, and ambitions in the fascinating world of cybersecurity."
        },
        "engineering": {
            "title": "Engineering Courses & Projects",
            "intro": "This section presents my main academic achievements and projects completed during my engineering studies. It highlights both theoretical and practical experiences that helped me develop technical skills, teamwork abilities, and problem-solving strategies.",
            "title_p1":"Connect Four Game",
            "title_p2":"Gradient Descent Project",
            "title_p3":"Java/Web Development Internship",
            "reflexion": "<strong>Reflection :</strong>",
            "description1": "Developed a Connect Four game in Python as part of a team project during my preparatory studies. The objective was mainly algorithmic, focusing on implementing efficient game logic and decision-making structures.",
            "description2": "This large 10-week group project combined theoretical and practical work around the gradient descent algorithm and its application to image recognition. Working collaboratively, we created our own dataset and developed algorithms to detect plastic bottles in the ocean, illustrating how mathematical optimization can be applied to environmental challenges.",
            "description3": "Completed a web development internship during my preparatory studies. The project involved both front-end and back-end aspects, giving me a better understanding of how software projects are structured in a professional environment.",
            "content1": "This was my first real coding project, marking my introduction to programming. As my teammates were less experienced in coding, I took the lead in implementing the main logic, then explained my subprograms to ensure group understanding. It was a great opportunity to strengthen both my technical autonomy and my communication skills within a team.",
            "content2": "Through this project, I learned how to apply mathematical principles to real-world problems in a collaborative setting. It helped me connect theoretical knowledge with concrete experimentation using Python and image recognition libraries, and strengthened my teamwork and project management skills over a long-term academic project. It also sparked my growing interest in AI and data-driven solutions.",
            "content3": "This experience taught me how to work with deadlines, apply clean coding practices, and build web applications that balance technical robustness with usability. It also reinforced my interest in creating solutions that have real-world impact.",
            "ahref_projet": "Gradient Descent Project Report",
            "ahref_stage": "Internship Report"
        },
        "mobility": {
            "title": "International Mobility",
            "intro": "This section focuses on my international experience and cultural openness as an engineering student. Whether through an exchange program, internship abroad, or a future mobility plan, I aim to broaden my perspective, improve my language skills, and discover new approaches to engineering around the world.",
            "content": "I am planning an international mobility and have highlighted the countries I am interested in on the world map. Click on each country to discover my motivations and what I aim to learn there.",

            "countries": [
                {
                    "code": "US",
                    "name": "The United States of America",
                    "color": "#1f77b4",
                    "reason": "The United States is a global leader in cybersecurity research and technological innovation. A mobility there would let me immerse myself in academic and industry environments focused on offensive security, while also improving my English skills and understanding of international cybersecurity practices."
                },
                {
                    "code": "BR",
                    "name": "Brazil",
                    "color": "#2ca02c",
                    "reason": "Brazil has a dynamic tech ecosystem and a rich culture to explore. A mobility there would allow me to engage with local universities and companies, experience innovative approaches to cybersecurity, and improve my Portuguese skills in a professional and academic context."
                },
                {
                    "code": "MX",
                    "name": "Mexico",
                    "color": "#ff7f0e",
                    "reason": "Mexico offers interesting universities and opportunities to work on regional cybersecurity challenges. A mobility there would enable me to participate in local academic projects, gain insights into Latin American cybersecurity practices, and improve my Spanish skills in a practical environment."
                }
            ]
        },
        "civic": {
            "title": "Civic Engagement & Sustainability",
            "intro": "Here I share my involvement in social, civic, or environmental activities that contribute to building a responsible and sustainable society. These experiences have helped me develop a sense of social responsibility, teamwork, and awareness of global issues beyond technical challenges.",
            "content": "Throughout my academic journey, I have taken part in various initiatives that allowed me to develop a sense of responsibility and teamwork. In Toulouse, I participated in a clean walk organized by the Bureau of Sustainable Development, contributing to local environmental awareness. I also briefly engaged in a project during my engineering studies aimed at detecting plastic bottles in oceans. Beyond environmental initiatives, I am actively involved in school life: I serve as a mentor and intervenant for my school’s Junior Enterprise and regularly participate in events organized by the Net7 IT club. Previously, during my preparatory classes, I was a member of the Student Council, an experience that helped me build organizational and leadership skills. These activities have taught me how to collaborate effectively, manage responsibilities, and apply my skills in diverse contexts."
        },
        "activities": {
            "title": "Sports & Activities",
            "intro": "Beyond academics, I believe in the importance of balance and personal development through sports and hobbies. Here I share the activities that inspire me, help me stay motivated, and allow me to cultivate teamwork, perseverance, and creativity.",

            "cards": [{
                    "title": "Rugby & Basketball",
                    "icon": "🏉🏀",
                    "description": "I practiced these sports for several years, which taught me the value of teamwork, communication, and collaboration."
                },
                    {
                    "title": "Music",
                    "icon": "🎵",
                    "description": "In parallel, I studied music for 12 years, an experience that strengthened my creativity, listening skills, and attention to detail."
                },
                    {
                    "title": "Tennis & Weight Training",
                    "icon": "🎾🏋️",
                    "description": "Sports are an essential part of my daily routine. I practice these activities almost every day to develop discipline, perseverance, and long-term commitment."
                },
                {
                    "title": "Cooking",
                    "icon": "👨‍🍳",
                    "description": "I really enjoy cooking, whether it’s experimenting with new flavors or sharing a pleasant moment with friends. Cooking allows me to develop creativity, precision, and the ability to follow structured processes while staying flexible and inventive, qualities that I also apply to the way I approach my technical projects."
                }
            ],
            "conclusion": "These different activities, both athletic and artistic, help me maintain a healthy balance between personal challenge, teamwork, and self-expression, qualities that I aim to bring into my engineering and cybersecurity projects."
        },
        "career": {
            "title": "Career Development",
            "intro": "This section summarizes my professional profile, including my CV, career goals, and personal projects that shape my future as an engineer. You will also find links to my LinkedIn profile, resume, and a brief video presentation describing my ambitions and professional values.",
            "career": "<strong>Personal Projects & Future Goals :</strong>",
            "content_cyber":"I’ve always been driven by curiosity and the desire to build things that matter. Alongside my studies, I explore cybersecurity independently through TryHackMe, where I’m developing strong foundations in offensive security and penetration testing, skills I plan to refine throughout my career.",
            "content_clok":"Beyond cybersecurity, I love turning ideas into real prototypes. One of my ongoing personal projects is a physical alarm clock built on a Raspberry Pi. It plays a custom song chosen through a web interface — a small but fun challenge that blends web development, networking, and embedded systems.",
            "content_JE": "I’m also involved as a contributor for my school’s Junior Enterprise, which gives me the opportunity to work on real projects for clients and share my knowledge with others. These experiences help me connect technical curiosity with real-world impact.",
            "content_startup": "More recently, I’ve been working with a close friend on the early stages of a startup idea. We’re still exploring the concept and direction, but this journey fuels my interest in innovation, teamwork, and building something meaningful from scratch.",
            "conclusion": "Ultimately, I see my future as a cybersecurity engineer who combines technical expertise with creativity and initiative — someone who doesn’t just analyze systems, but designs and improves them."
        },
        "footer": "© 2025 GELINEAU Arthur | ePortfolio @ N7"
    },

    "fr": {
        "header" : {
            "title": "Etudiant à l'ENSEEIHT"
        },
        "nav": {
            "home": "Accueil",
            "engineering": "Cours & Projets d’Ingénierie",
            "mobility": "Mobilité Internationale",
            "civic": "Engagement & Développement Durable",
            "activities": "Sports & Activités",
            "career": "Développement Professionel"
        },
        "home": {
            "title": "Bienvenue",
            "intro": "Bonjour ! Je m’appelle Arthur GELINEAU, j’ai 19 ans et je suis actuellement étudiant à l’ENSEEIHT (INP Toulouse) dans le département Sciences du Numérique. Passionné par la cybersécurité, je m’intéresse autant à sa dimension technique, à travers le pentest, la Red Team et le bug bounty, qu’à ses enjeux stratégiques et entrepreneuriaux.",
            "p1": "À travers cet ePortfolio, je souhaite partager mon parcours, mes projets et mes réflexions sur le domaine de la cybersécurité. Il reflète à la fois mon apprentissage à l’ENSEEIHT et en autodidacte, ma curiosité technique et mon envie de comprendre les défis de sécurité dans un monde numérique en constante évolution.",
            "p2": "Je suis particulièrement attiré par la sécurité offensive et par la découverte des enjeux de cybersécurité appliqués à la défense et aux systèmes critiques, où rigueur et fiabilité sont essentielles.",
            "p3": "N’hésitez pas à explorer les différentes sections pour découvrir mon parcours académique, mes projets techniques et mes aspirations dans le domaine passionnant de la cybersécurité."
        },
        "engineering": {
            "title": "Cours et Projets d’Ingénierie",
            "intro": "Cette section présente mes principales réalisations académiques et les projets effectués au cours de mes études d’ingénieur. Elle met en avant les expériences théoriques et pratiques qui m’ont permis de développer mes compétences techniques, mon esprit d’équipe et mes capacités de résolution de problèmes.",
            "title_p1":"Puissance 4",
            "title_p2":"Projet sur la Descente de Gradient",
            "title_p3":"Stage de Développement Web/Java",
            "reflexion": "<strong>Reflexion :</strong>",
            "description1": "Développement d’un jeu Puissance 4 en Python dans le cadre d’un projet de groupe en classes préparatoires. L’objectif principal était algorithmique, axé sur la conception d’une logique de jeu efficace et bien structurée.",
            "description2": "Projet mêlant théorie et pratique autour de la descente de gradient et de ses applications à la reconnaissance d’images. Nous avons créé notre propre dataset et conçu nos propres algorithmes pour détecter des bouteilles plastiques dans l’océan, reliant ainsi l’apprentissage automatique à une problématique environnementale concrète.",
            "description3": "Stage effectué en développement web au cours de ma prépa. J’y ai travaillé à la fois sur le front-end et le back-end, découvrant le fonctionnement complet d’un projet informatique en entreprise.",
            "content1": "Il s’agissait de mon premier vrai projet de programmation. Mes coéquipiers étant moins à l’aise avec le code, j’ai pris en charge la plus grande partie du développement avant d’expliquer le fonctionnement global et mes sous-programmes. Cette expérience m’a permis de renforcer mon autonomie technique et mes compétences en communication technique.",
            "content2": "Ce projet m’a permis d’appliquer des notions mathématiques à un problème réel, de lier la théorie à la pratique et d’explorer des bibliothèques Python dédiées à la vision par ordinateur. Il a éveillé mon intérêt pour l’intelligence artificielle et le traitement de données.",
            "content3": "Cette expérience m’a permis de comprendre les contraintes réelles d’un environnement professionnel, d’améliorer ma rigueur et mes pratiques de code, tout en consolidant mon intérêt pour la conception d’applications fonctionnelles et intuitives.",
            "ahref_projet": "Compte Rendu du projet de la Descente de Gradient",
            "ahref_stage": "Rapport de Stage"
        },
        "mobility": {
            "title": "Mobilité Internationale",
            "intro": "Cette section met en avant mon ouverture internationale et mon expérience à l’étranger en tant qu’étudiant ingénieur. Que ce soit à travers un programme d’échange, un stage à l’étranger ou un projet de mobilité future, mon objectif est d’élargir mes horizons, de perfectionner mes compétences linguistiques et de découvrir de nouvelles approches de l’ingénierie à travers le monde. ",
            "content": "Je projette de faire une mobilité internationale et ai sélectionné les pays qui m’intéressent sur la carte du monde. Cliquez sur chaque pays pour découvrir mes motivations et ce que je souhaite y apprendre.",

            "countries": [
                {
                    "code": "US",
                    "name": "États-Unis",
                    "color": "#1f77b4",
                    "reason": "Les États-Unis sont un leader mondial dans la recherche en cybersécurité et l'innovation technologique. Une mobilité là-bas me permettrait de m’immerger dans des environnements académiques et industriels axés sur la sécurité offensive, tout en perfectionnant mon anglais et en acquérant une vision internationale des pratiques en cybersécurité."
                },
                {
                    "code": "BR",
                    "name": "Brésil",
                    "color": "#2ca02c",
                    "reason": "Le Brésil possède un écosystème technologique dynamique et une culture riche à découvrir. Une mobilité là-bas me permettrait de collaborer avec des universités et entreprises locales, d’expérimenter des approches innovantes en cybersécurité, et de perfectionner mon portugais dans un contexte académique et professionnel."
                },
                {
                    "code": "MX",
                    "name": "Mexique",
                    "color": "#ff7f0e",
                    "reason": "Le Mexique offre des universités intéressantes et des opportunités de travailler sur des problématiques régionales de cybersécurité. Une mobilité là-bas me permettrait de participer à des projets académiques locaux, d’acquérir des connaissances sur les pratiques de cybersécurité en Amérique Latine, et de perfectionner mon espagnol dans un contexte pratique."
                }
            ]
        },
        "civic": {
            "title": "Engagement & Développement Durable",
            "intro": "Je présente ici mon engagement dans des activités sociales, citoyennes ou environnementales contribuant à une société plus responsable et durable. Ces expériences m’ont permis de renforcer mon sens des responsabilités, mon esprit d’équipe et ma conscience des enjeux globaux au-delà des défis techniques.",
            "content": "Au cours de mon parcours académique, j’ai participé à différentes initiatives qui m’ont permis de développer mon sens des responsabilités et du travail en équipe. À Toulouse, j’ai pris part à une clean walk organisée par le Bureau du Développement Durable, contribuant à la sensibilisation locale à l’environnement. J’ai également mentionné un projet académique visant à détecter des bouteilles en plastique dans les océans. Au-delà de ces initiatives, je m’investis dans la vie scolaire : je suis intervenant pour la Junior Entreprise de mon école et je participe régulièrement aux événements du club Net7 informatique. Plus tôt dans mon cursus, lors de mes classes préparatoires, j’ai été membre du Bureau des Étudiants, une expérience qui m’a permis de développer des compétences organisationnelles et de leadership. Ces expériences m’ont appris à collaborer efficacement, à gérer des responsabilités et à mettre mes compétences en pratique dans différents contextes."
        },
        "activities": {
            "title": "Sports & Activités",
            "intro": "Au-delà des études, je crois en l’importance de l’équilibre et du développement personnel à travers le sport et les loisirs. Je présente ici les activités qui me passionnent, me motivent et me permettent de cultiver l’esprit d’équipe, la persévérance et la créativité.",

            "cards": [{
                    "title": "Rugby & Basket",
                    "icon": "🏉🏀",
                    "description": "J’ai pratiqué le rugby et le basket-ball pendant plusieurs années, deux disciplines qui m’ont appris l’importance de la cohésion, de la communication et de l’effort collectif."
                },
                    {
                    "title": "Musique",
                    "icon": "🎵",
                    "description": "En parallèle, j’ai suivi pendant 12 ans de formation musicale, une expérience qui a développé ma créativité, mon sens de l’écoute et ma capacité à travailler avec précision."
                },
                    {
                    "title": "Tennis & Musculation",
                    "icon": "🎾🏋️",
                    "description": "Le sport occupe une place importante dans ma vie quotidienne. Aujourd'hui, je pratique ces activités presque tous les jours, pour cultiver la rigueur, la persévérance et la gestion de l’effort dans la durée."
                },
                {
                    "title": "Cuisine",
                    "icon": "👨‍🍳",
                    "description": "J’aime beaucoup cuisiner, que ce soit pour expérimenter de nouvelles saveurs ou pour partager un bon moment entre amis. La cuisine me permet de développer ma créativité, ma précision et ma capacité à suivre des processus tout en restant flexible et inventif, des qualités que je retrouve aussi dans ma manière d’aborder mes projets techniques."
                }
            ],
            "conclusion": "Ces différentes activités, sportives et artistiques, me permettent de garder un bon équilibre entre défi personnel, travail en équipe et expression individuelle, des qualités que je cherche à entretenir dans mes projets d’ingénierie et de cybersécurité."
        },
        "career": {
            "title": "Développement Professionel",
            "intro": "Cette section résume mon profil professionnel, incluant mon CV, mes objectifs de carrière et les projets personnels qui façonnent mon avenir d’ingénieur. Vous y trouverez également les liens vers mon profil LinkedIn, mon CV et une courte vidéo de présentation de mes ambitions et de mes valeurs professionnelles.",
            "career": "<strong>Projets Personnels & Amibitions Futures :</strong>",
            "content_cyber":"J’ai toujours été animé par la curiosité et l’envie de créer des projets qui ont du sens. En parallèle de mes études, je me forme de manière autonome à la cybersécurité via TryHackMe, où je développe des bases solides en sécurité offensive et en pentest, des compétences que je souhaite approfondir tout au long de ma carrière.",
            "content_clok":"Au-delà de la cybersécurité, j’aime concrétiser mes idées à travers des prototypes. L’un de mes projets personnels actuels est un réveil physique basé sur un Raspberry Pi, capable de jouer une musique personnalisée choisie depuis une interface web. Un petit défi mêlant développement web, systèmes embarqués et réseau.",
            "content_JE": "Je suis également impliqué en tant qu’intervenant au sein de la Junior Entreprise de mon école, ce qui me permet de travailler sur des projets réels pour des clients et de partager mes connaissances avec d’autres étudiants. Ces expériences me poussent à relier ma curiosité technique à des applications concrètes.",
            "content_startup": "Plus récemment, je collabore avec un ami sur les prémices d’un projet de start-up. Même si notre idée est encore en construction, ce processus stimule ma créativité et mon goût pour l’innovation et l’entrepreneuriat.",
            "conclusion": "À terme, je me vois comme un ingénieur en cybersécurité alliant expertise technique, créativité et esprit d’initiative — un profil capable non seulement d’analyser des systèmes, mais aussi d’imaginer et d’améliorer ceux de demain."
        },
        "footer": "© 2025 GELINEAU Arthur | ePortfolio @ N7"
    }
}
